Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/freedom_of_movement_within_the_eu/common_travel_area_between_ireland_and_the_uk.html.txt.tmx
Source language: en
Languages: ga

source: Common Travel Area between Ireland and the United Kingdom
ga: Comhlimistéar Taistil idir Éire agus an Ríocht

source: A common travel area is in existence between Ireland and the UK (including the Channel Islands and the Isle of Man)
ga: Tá limistéar taistil ann idir Éire agus an Ríocht Aontaithe (Oileáin Mhuir nIocht agus Oileán Mhanann san áireamh)

source: The Common Travel Area has been in operation since the 1920s but is not specifically provided for in legislation
ga: Tá an Comhlimistéar Taistil i bhfeidhm ó na 1920idí ach ní dhéantar foráil shonrach dó sa reachtaíocht

source: The first legal recognition of the Common Travel Area between Ireland and the United Kingdom (UK) is contained in the Treaty of Amsterdam
ga: Cuimsítear an chéad aitheantas dlíthiúil den Chomhlimistéar Taistil idir Éirinn agus an Ríocht Aontaithe i gConradh Amstardam

source: The Irish Government and the UK government have agreed reciprocal visa arrangements; measures to increase the security of the external Common Travel Area border; and to share immigration data between the two countries’ immigration authorities
ga: Chomhaontaigh Rialtas na hÉireann agus rialtas an RA ar shocruithe cómhalartacha víosa; bearta chun slándáil theorainn sheachtrach an Chomhlimistéir Thaistil a mhéadú; agus chun sonraí faoi inimirce a roinnt idir údaráis inimirce an dá thíre

source: The Common Travel Area means that there are no passport controls in operation for Irish and UK citizens travelling between the 2 countries
ga: Ciallaíonn An Comhlimistéar Taistil nach bhfuil rialú pas i bhfeidhm do shaoránaigh Éireannacha agus na Ríochta Aontaithe atá ag taisteal idir an dá thír

source: You do not need to have a passport in order to enter the other country
ga: Ní ga duit pas a bheith agat chun an tír eile a iontráil

source: However, all air and sea carriers require some form of identification and some regard a passport as the only valid identification
ga: Teastaíonn foirm éigin d’aitheantas, áfach, ó gach aeriompróir agus iompróir ar muir agus ní ghlacann roinnt díobh ach le pas mar an t-aon aitheantas bailí

source: Immigration authorities may also require you to have valid official photo-identification which shows your nationality
ga: Anuas air sin, d’fhéadfadh údaráis inimirce a cheangal ort aitheantas bailí oifigiúil grianghraif a bheith agat a thaispeánann do náisiúntacht

source: As you are being asked to prove that you are an Irish or UK citizen who is entitled to avail of the Common Travel Area arrangements, it is advisable to travel with your passport
ga: Mar gheall go bhfuiltear ag iarraidh ort a chruthú gur saoránach Éireannach nó RA thú atá i dteideal fáil a bheith agat ar shocruithe an Chomhlimistéir Thaistil, moltar duit taisteal agus do phas agat

source: The Common Travel Area also involves some co-operation on matters relating to immigration issues
ga: Bíonn roinnt comhoibrithe i gceist leis an limistéar taistil choitinn freisin maidir le ceisteanna inimirce

source: A third country national, for example, may be refused permission to enter Ireland if it is their intention to travel onwards to the UK and they would not qualify for admission to the UK under the Aliens (Amendment) Order 1975
ga: D'fhéadfadh sé tarlú go ndiúltófar d'náisiúnta an triú tír teacht isteach go hÉirinn má tá sé ar intinn aige/aice taisteal ar aghaidh go dtí an Ríocht Aontaithe, agus nach mbeadh sé/sí ceadaithe faoi Ordú na nEachtrannach (Leasú) 1975

source: Irish immigration officers have the power to carry out checks on people arriving in the State from the UK and to refuse them entry to the State on the same grounds as apply to people arriving from outside the Common Travel Area
ga: Tá sé de chumhacht ag Oifigigh Inimirce na hÉireann seiceálacha a chur ar dhaoine a thagann isteach sa Stát ón Ríocht Aontaithe agus cead isteach a dhiúltu dóibh ar na forais chéanna agus a fheidhmíonn do dhaoine ag teacht ó lasmuigh den Comhlimistéar Taistil

source: These checks are carried out selectively
ga: Cuirtear na seiceálacha sin i gcrích go roghnaíoch

source: In December 2011, the Irish and UK governments agreed measures to secure the external Common Travel Area border
ga: I Nollaig 2011, chomhaontaigh rialtais na hÉireann agus an RA ar bhearta chun teorainn an Chomhlimistéir Thaistil a chur faoi shlándáil

source: This includes exchanging biographic and biometric visa data and co-operating on establishing information about failed asylum seekers
ga: Áirítear leis seo sonraí beathaisnéiseacha agus bithmhéadracha víosa a mhalartú agus comhoibriú a dhéanamh ar fhaisnéis a bhunú faoi iarrthóirí tearmainn ar theip orthu

source: There is a joint UK-Ireland Common Travel Area Forum which implements these measures
ga: Tá Comhfhóram Chomhlimistéar Taistil na hÉireann-an RA ann a chuireann na bearta seo i bhfeidhm

source: People with UK visas or residence permits
ga: Daoine a mbíonn víosa nó ceadúnas cónaithe de chuid an Ríocht Aontaithe acu

source: If you are a citizen of a country whose nationals need a visa to enter Ireland and you have a valid UK visa or residence permit, you may be required to have a valid visa before you arrive in Ireland
ga: Más saoránach tú de chuid tír a dteastaíonn víosa óna náisiúnaigh chun teacht isteach sa Stát agus go bhfuil víosa nó ceadúnas cónaithe de chuid an RíochtaAontaithe, ar bhailí é, i do sheilbh agat, b'fhéidir go mbeidh gá duit víosa bhailí a bheith agat sula dtagann tú isteach sa Stát

source: The Short Stay Visa Waiver Programme allows nationals of a number of Eastern European, Middle East and Asian countries who have a short-term UK visa to come to Ireland without the need for a separate Irish visa
ga: Ceadaíonn an Clár Tarscaoilte Víosa Gearrchuairte do náisiúnaigh líon tíortha in Oirthear na hEorpa, an Meánoirthear agus san Áise a bhfuil víosa gearrthéarma RA acu chun teacht go hÉirinn gan víosa Éireannach ar leith a bheith ag teastáil uathu

source: This programme has been extended to 31 October 2021
ga: Síntear an clár seo go dtí 31 Deireadh Fómhair 2021

source: Reciprocal visa arrangements: A British Irish Visa Scheme applies to visitors from China since 20 October 2014 and to visitors from India since 9 February 2015
ga: Socruithe cómhalartacha víosa: Baineann an Scéim Víosa na Breataine-na hÉireann le cuairteoirí ón tSín ón 20 Deireadh Fómhair 2014 ar aghaidh agus le cuairteoirí ón India ón 9 Feabhra 2015 ar aghaidh

source: This scheme allows visitors from these countries to travel freely within the Common Travel Area (in this case, Ireland and the UK but not the Channel Islands and the Isle of Man), using either an Irish or UK visa
ga: Ligeann an scéim seo chuairteoirí ó na tíortha seo taisteal gan srian laistigh den Chomhlimistéar Taistil (sa chás seo, Éire agus an RA, seachas Oileáin Mhuir nIocht agus Manainn), agus víosa Éireannach nó RA á úsáid

source: Both schemes are provided for in the Immigration Act (Visas) Order 2014 (SI 473/2014) as amended by SI 502/2016 (pdf)
ga: Déantar foráil don dá scéim san Acht Inimirce (Víosaí) Ordú 2014 (IR 473/2014) arna leasu ag IR 502/2016 (pdf)

source: Further information about visa applications is in our document, Visa requirements for entering Ireland, or can be obtained from Irish embassies and consulates abroad
ga: Is féidir tuilleadh eolais a fháil i dtaobh iarratas ar víosa inár ndoiciméad, Riachtanais víosa le teacht isteach in Éirinn nó ó ambasáidí agus ó chonsalachtaí na hÉireann thar lear
